import corn from "./corn.jpg";
import blueberry from "./blueberry.jpg";
import cherry from "./cherry.jpg";
import apple from "./apple.jpg";
import grape from "./grape.jpg";
import orange from "./orange.jpg";
import peach from "./peach.jpg";
import pepper from "./pepper.jpg";
import potato from "./potato.jpg";
import raspberry from "./raspberry.jpg";
import soybean from "./soybean.jpg";
import strawberry from "./strawberry.jpg";
import tomato from "./tomato.jpg";

import cornHeBan from "./corn-heban.jpg";
import cornBugs from "./corn-bugs.png";
import cornJingFu from "./corn-jingfubing.jpg";

export const fruits = [
  {
    name: "玉米",
    engName: "corn",
    img: corn,
    desp: `玉蜀黍（学名：Zea mays L.）是禾本科、玉蜀黍属植物，俗称玉米。 一年生高大草本。秆直立，通常不分枝，高1-4米，基部各节具气生支柱根。叶鞘具横脉；叶舌膜质，长约2毫米；叶片扁平宽大，线状披针形，基部圆形呈耳状。顶生雄性圆锥花序大型，主轴与总状花序轴及其腋间均被细柔毛；雄性小穗孪生，长达1厘米，小穗柄一长一短。颖果球形或扁球形，成熟后露出颖片和稃片之外，其大小随生长条件不同产生差异，一般长5-10毫米，宽略过于其长，胚长为颖果的1/2-2/3。花果期秋季。\n
        玉蜀黍的营养价值较高，是优良的粮食作物。作为中国的高产粮食作物，玉蜀黍是畜牧业、养殖业、水产养殖业等的重要饲料来源，也是食品、医疗卫生、轻工业、化工业等的不可或缺的原料之一。此外，还具有许多生物活性，如抗氧化、抗肿瘤、降血糖、提高免疫力和抑菌杀菌等，其具有广阔的开发及应用前景。
        `,
    disease: `
            玉蜀黍主要病害有褐斑病、大小班病、锈病、茎腐病等，要及时用甲基托布津、多菌灵或三唑酮喷雾防治。当出现病菌后，玉米植株上会有明显危害现象。因此，种植人员要重视植株生长状况，及时关注玉米生长过程中出现的变化。病害不仅影响植株生长，同时还具有一定的传染性。在病害防治中，农药应用具有重要作用。但过度使用农药，会对植物生长及后期人类食用造成危害。因此，在施用农药时，需要提前掌握农药用量。\n
            玉米穗期如果遇雨雾频繁、温度较低天气时，通常会引起小斑病、纹枯病等大面积暴发。以纹枯病为例，其主要发病部位在果穗和叶鞘，茎秆上也可能会出现，发病后叶片出现淡褐色斑块。随着时间推移，病情加重，病害从基部叶鞘开始向植株上部蔓延，最终发展至果穗，使穗苞出现云纹状大块病斑。常用氟硅唑37.5毫升/公顷兑水2 250升/公顷进行叶面喷雾防治。灌浆成熟期，主要病害为早衰和青枯病，通常采用抗病能力强的良种，加强田间管理工作，确保玉米群体透光通风。防治小斑病，可采用50%多菌灵或70%甲基托布津可湿性粉剂500倍液进行喷防，每隔7-10天喷施1次。\n
            玉蜀黍虫害主要有玉米螟和蚜虫等，要及时用吡虫啉、氯氰菊酯等进行化学防治。玉蜀黍病虫害防治要以防为主、以治为辅。对病虫害要进行针对性防治，做到早防早治。可以进行药剂拌种和玉蜀黍种子包衣，这样不仅可以防治病虫害，还可以促进玉蜀黍苗的健壮生长。
            `,
    sicks: [
      {
        name: "褐斑病",
        img: cornHeBan,
        desp:'主要是由立枯丝核菌引起的一种真菌病害,主要是由立枯丝核菌引起的一种真菌病害,主要是由立枯丝核菌引起的一种真菌病害'
      },
      {
        name: "玉米螟",
        img: cornBugs,
        desp:'玉米螟，又叫玉米钻心虫，属于鳞翅目，螟蛾科'
      },
      {
        name: "茎腐病",
        img: cornJingFu,
      },
      {
        name: "茎腐病",
        img: cornJingFu,
      },
      {
        name: "茎腐病",
        img: cornJingFu,
      },
      {
        name: "茎腐病",
        img: cornJingFu,
      },{
        name: "茎腐病",
        img: cornJingFu,
      },
    ],
  },
  {
    name: "蓝莓",
    img: blueberry,
    engName: "blueberry",
    desp: `蓝莓（学名：Vaccinium spp.）是杜鹃花科、越橘属蓝果类型植物的俗称。多年生低灌木。灌木丛生，树体大小及形态差异显著。蓝莓的花为总状花序。花序大部分侧生，有时顶生。通常由7-10朵花组成，花两性。蓝莓果实大小、颜色因种类而异。多数品种成熟时果实呈深蓝色或紫罗兰色，如兔眼蓝莓、高丛蓝莓和矮丛蓝莓等，少数品种为红色。果实有球形、椭圆形、扁圆形或梨形。蓝莓果实一般在花后70-90天成熟。果肉细软，多浆汁。种子细小，食用时可随果肉食下而不影响口感。\n
      蓝莓作为一种具有较高经济价值和广阔开发前景的新兴小浆果树种，蓝莓果实肉质细腻，种子极小，甜酸适口，有清爽宜人的香气，富含多种维生素及微量元素等营养物质。蓝莓鲜果既可生食，又可作加工果汁、果酒、果酱等的原料，具有较高的经济价值。在英国权威营养学家列出的全球15种健康食品中，蓝莓居于首位，并被国际粮农组织列为人类五大健康食品；之一，被誉为“浆果之王”。
      `,
    disease: `蓝莓枯焦病毒受害植株表现症状主要在早春花期，主要表现为花萎焉，并少量死亡，老叶叶缘视力表。受害植株表现症状主要在早春花期，主要表现为花萎焉，并少量死亡，老叶叶缘视力表。\n
      蓝莓叶片斑点病有些受害5-6年表现为多年生茎干死亡，新生枝干矮小并畸形，叶片有斑点.此病主要由蜜蜂和大黄蜂的授粉活动传播，可以切断传播途径防治，但是最佳的方法就是清除病株。\n
      花叶病也是蓝莓生产中普遍发生的一种病害，可减产15%以上，主要症状是叶片变黄绿、黄色并出现斑点或环状枯焦，有时呈紫色病斑，不同年份症状表现也不同，在某一年表现症状严重，但下一年则不表现症状。此病主要依靠蚜虫和带病毒苗木传播，所以使用杀虫剂控制蚜虫和培育无病毒苗木能有效的防治此病发生。
      `,
  },
  {
    name: "樱桃",
    img: cherry,
    engName: "cherry",
    desp: `樱桃（学名：Cerasus spp.）是蔷薇科、樱属几种植物的统称。世界上作为栽培的樱桃仅有4种，即樱桃（Cerasus pseudocerasus (Lindl.) G. Don）、欧洲甜樱桃（Cerasus avium (L.) Moench.）、欧洲酸樱桃（Cerasus vulgaris Mill.）和毛樱桃（Cerasus tomentosa (Thunb.) Wall.）。 [1]  其中在生产上起重要作用的是樱桃、欧洲甜樱桃和欧洲酸樱桃。 [2]  乔木或灌木，高2-25米，树皮灰白色或黑褐色。小枝灰褐色或灰棕色，嫩枝绿色，无毛或被疏柔毛。冬芽卵状椭圆形，无毛。叶片卵形、椭圆形或长圆状卵形，先端骤尖或短渐尖，基部圆形或楔形。花序伞形，有花3-4朵，花叶同开；花梗长0.8-3.4厘米，被疏柔毛或无毛；萼片三角卵圆形或卵状长圆形，先端圆钝或急尖；花瓣白色或粉红色，倒卵形。核果近球形或卵球形，呈红色至紫黑色，直径0.9-2.5厘米。花期3-5月，果期5-9月。`,
    disease: `流胶病防治：避免在粘性土壤建园，增施有机肥料，防止旱、涝、冻害，强壮树势，提高树体抗性；树干涂白，预防日灼；加强病虫害防治，特别是蛀干害虫的防治；修剪注意减少伤口，避免机械损伤；对已发病的枝干及时、彻底刮治，伤口用生石灰10份、石硫合剂1份、食盐2份、植物油0.3份加水调制成的保护剂涂抹。\n 
      膏药病防治：及时开沟排水，保持园内通风透光；刮除菌膜集中烧毁，并在病部涂抹5-6°Be石硫合剂；在高温多雨、病害多发的夏秋季，可喷50%退菌特可湿性粉剂800倍液或70%甲基托布津可湿性粉剂1000倍液防治。\n
      桃红颈天牛防治：6月上中旬成虫孵化前，在枝上喷抹涂白剂，以防成虫产卵。成虫孵化期（6月下旬至7月中旬）中午多静伏在树干上，可进行人工捕杀。在幼虫危害期，当发现有鲜粪排出蛀孔时，用铁丝钩出蛀孔中虫粪，用小棉球蘸80%敌敌畏乳剂200倍液，堵塞在蛀孔中，再用调好的黄泥封口熏杀幼虫。\n
      桑白蚧防治：冬季进行抹、刷虫体，或刮除树皮上越冬的虫体，并用粘土、柴油乳剂涂抹树干（柴油1份+细粘土1份+水2份，混合而成），粘杀虫体。萌芽前喷洒50倍液机油乳剂或5°Be石硫合剂，防治越冬雌成虫。在各代初孵若虫尚未形成介壳以前（5月中旬、7月中旬、9月中旬），喷40%杀扑磷乳油1000倍液，间隔20天再喷1次即可有效防治\n
      樱桃瘿瘤头蚜防治：樱桃树开花前，全树喷施2.5%鱼藤酮乳油750倍液，杀灭越冬虫卵效果好。樱桃谢花后一周，越冬虫卵开始孵化，尚未形成虫瘿时，喷施3%天然除虫菊素微胶囊悬浮剂1000-1500倍液或2.5%鱼藤酮乳油400-500倍液进行防治`,
  },
  {
    name: "苹果",
    img: apple,
    engName: "apple",
    desp: `苹果（Malus pumila Mill.），是落叶乔木，通常树木可高至15米，但栽培树木一般只高3-5米左右。树干呈灰褐色，树皮有一定程度的脱落。苹果树开花期是基于各地气候而定，但一般集中在4-5月份。苹果是异花授粉植物，大部分品种自花不能结成果实。\n
    一般苹果栽种后，于2-3年才开始结出果实。果实一般呈红色，但需视乎品种而定。苹果树的果实富含矿物质和维生素，为人们最常食用的水果之一。果实成长期之长短，一般早熟品种为65-87天，中熟品种为90-133天，晚熟品种则为137-168天。在一般情形下，栽种后苹果可有15-50年寿命。`,
    disease: `果树粗翘皮常常隐藏着多种病害，如山楂红蜘蛛、星毛虫、小卷叶虫、腐烂病等。冬剪结束后，从2月中旬起重点检查主干、枝杈、剪锯口有无腐烂病，随发现随后涂波美10度石硫合剂加入“护树将军”100倍液，半月后再涂一次。涂树体病患处可迅速形成一层保护膜，窒息性杀死病菌，方法是用毛刷涂乳液，再用护树将军乳液100倍液（50千克）全园喷涂树干和树枝消毒，可阻碍腐烂病毒着落于树体繁衍，30天后染有死孢子的病皮开始脱落，“护树将军”还可与各类农药或叶面肥混和使用。\n
    斑点落叶病一般年份6月下旬开始发病，7月下旬至8月上旬为发病盛期。春雨早发病早，秋雨多发病重。10月上旬停止发生。防治苹果斑点落叶病，应重视化学防治，从花后开始连续喷50%扑海因可湿性粉剂1000倍+瓜果壮蒂灵或70%代森锰锌可湿性粉剂500倍+瓜果壮蒂灵，或10%多氧霉素1200倍+瓜果壮蒂灵，或40%乙磷铝200倍+瓜果壮蒂灵，或70%乙锰500倍+瓜果壮蒂灵。石灰多量式波尔多液也有较好的防治效果。目前已进入中秋季节，各类早期落叶病将逐渐停止新的侵染。但对于发病较重的果园，应及时清扫果园落叶，剪除病枝，集中深埋，以消灭病源，减少发病率。
    `,
  },
];
