import corn from "./corn.jpg";
import blueberry from "./blueberry.jpg";
import cherry from "./cherry.jpg";
import apple from "./apple.jpg";
import grape from "./grape.jpg";
import orange from "./orange.jpg";
import peach from "./peach.jpg";
import pepper from "./pepper.jpg";
import potato from "./potato.jpg";
import raspberry from "./raspberry.jpg";
import soybean from "./soybean.jpg";
import strawberry from "./strawberry.jpg";
import tomato from "./tomato.jpg";

export const fruits = [
  {
    name: "玉米",
    engName: "corn",
    img: corn,
    desp: `玉蜀黍（学名：Zea mays L.）是禾本科、玉蜀黍属植物，俗称玉米。 一年生高大草本。秆直立，通常不分枝，高1-4米，基部各节具气生支柱根。叶鞘具横脉；叶舌膜质，长约2毫米；叶片扁平宽大，线状披针形，基部圆形呈耳状。顶生雄性圆锥花序大型，主轴与总状花序轴及其腋间均被细柔毛；雄性小穗孪生，长达1厘米，小穗柄一长一短。颖果球形或扁球形，成熟后露出颖片和稃片之外，其大小随生长条件不同产生差异，一般长5-10毫米，宽略过于其长，胚长为颖果的1/2-2/3。花果期秋季。\n
        玉蜀黍的营养价值较高，是优良的粮食作物。作为中国的高产粮食作物，玉蜀黍是畜牧业、养殖业、水产养殖业等的重要饲料来源，也是食品、医疗卫生、轻工业、化工业等的不可或缺的原料之一。此外，还具有许多生物活性，如抗氧化、抗肿瘤、降血糖、提高免疫力和抑菌杀菌等，其具有广阔的开发及应用前景。
        `,
    disease: `
            玉蜀黍主要病害有褐斑病、大小班病、锈病、茎腐病等，要及时用甲基托布津、多菌灵或三唑酮喷雾防治。当出现病菌后，玉米植株上会有明显危害现象。因此，种植人员要重视植株生长状况，及时关注玉米生长过程中出现的变化。病害不仅影响植株生长，同时还具有一定的传染性。在病害防治中，农药应用具有重要作用。但过度使用农药，会对植物生长及后期人类食用造成危害。因此，在施用农药时，需要提前掌握农药用量。\n
            玉米穗期如果遇雨雾频繁、温度较低天气时，通常会引起小斑病、纹枯病等大面积暴发。以纹枯病为例，其主要发病部位在果穗和叶鞘，茎秆上也可能会出现，发病后叶片出现淡褐色斑块。随着时间推移，病情加重，病害从基部叶鞘开始向植株上部蔓延，最终发展至果穗，使穗苞出现云纹状大块病斑。常用氟硅唑37.5毫升/公顷兑水2 250升/公顷进行叶面喷雾防治。灌浆成熟期，主要病害为早衰和青枯病，通常采用抗病能力强的良种，加强田间管理工作，确保玉米群体透光通风。防治小斑病，可采用50%多菌灵或70%甲基托布津可湿性粉剂500倍液进行喷防，每隔7-10天喷施1次。\n
            玉蜀黍虫害主要有玉米螟和蚜虫等，要及时用吡虫啉、氯氰菊酯等进行化学防治。玉蜀黍病虫害防治要以防为主、以治为辅。对病虫害要进行针对性防治，做到早防早治。可以进行药剂拌种和玉蜀黍种子包衣，这样不仅可以防治病虫害，还可以促进玉蜀黍苗的健壮生长。
            `,
    sicks: [
      {
        name: "玉米褐斑病",
        img: "https://pic.imgdb.cn/item/625e85d4239250f7c5b93e72.png",
        desp: "主要是由立枯丝核菌引起的一种真菌病害,主要是由立枯丝核菌引起的一种真菌病害,主要是由立枯丝核菌引起的一种真菌病害",
      },
      {
        name: "玉米北叶斑病",
        img: "https://pic.imgdb.cn/item/625e85d4239250f7c5b93e6c.png",
        desp: "玉米北叶斑病又称条纹病、煤纹病、枯叶病、叶斑病等，是玉米的主要叶部病害，我国各地均有发生，危害较重。",
      },
      {
        name: "玉米茎腐病",
        img: "https://pic.imgdb.cn/item/625e85d4239250f7c5b93e85.png",
        desp: "该病是由真菌引起的，病原菌为半知菌亚门真菌禾谷镰孢、串珠镰刀菌。该病是土传病害，且由多种寄生和半寄生性病原菌引起。",
      },
      {
        name: "玉米丝黑穗病",
        img: "https://pic.imgdb.cn/item/625e85d4239250f7c5b93e79.png",
        desp: "玉米丝黑穗病又称乌米、哑玉米，是我国春玉米区重要病害。主要侵害玉米雌穗和雄穗。多在出穗后显症，但有些自交系在苗期显症，在4-5叶上生1-4条黄白条纹；另一种植株茎秆下粗上细，叶色暗绿，叶片变硬、上挺入笋状；",
      },
      {
        name: "玉米霜霉病",
        img: "https://pic.imgdb.cn/item/625e85d4239250f7c5b93e66.png",
        desp: "玉米霜霉病常在玉米幼苗期和成株期都可发生；病菌主要侵染叶片，也为害叶鞘和苞叶。",
      },
    ],
  },

  {
    name: "苹果",
    engName: "apple",
    img: apple,
    desp: `苹果（Malus pumila Mill.），是落叶乔木，通常树木可高至15米，但栽培树木一般只高3-5米左右。树干呈灰褐色，树皮有一定程度的脱落。苹果树开花期是基于各地气候而定，但一般集中在4-5月份。苹果是异花授粉植物，大部分品种自花不能结成果实。\n
        一般苹果栽种后，于2-3年才开始结出果实。果实一般呈红色，但需视乎品种而定。苹果树的果实富含矿物质和维生素，为人们最常食用的水果之一。果实成长期之长短，一般早熟品种为65-87天，中熟品种为90-133天，晚熟品种则为137-168天。在一般情形下，栽种后苹果可有15-50年寿命。\n
        中国辽宁、河北、山西、山东、陕西（目前，陕西是我国苹果种植面积最大、产量最高的苹果大省，苹果种植面积1100万亩，产量占到中国四分之一、世界七分之一。
        `,
    disease: `
            苹果叶部病害主要包括早期落叶病、白粉病、锈病、黑星病、病毒病、银叶病等。叶部病害的发生，易引起叶色改变或脱落，大量叶片脱落会削弱树势，使得树体对病害的抵抗能力减弱，进而使果实产量和品质下降。\n
            枝干病害主要包括枝干轮纹病、腐烂病、干腐病、溃疡病和木腐病等。其中，果树腐烂病对树体所造成的损失最为严重，不仅引起死枝、树体死亡，甚至会造成果园毁灭。其次为轮纹病和干腐病，这两种病害虽不至于导致树体死亡，但受其危害后也会严重削弱树势，并且果实易带菌而加重采后病害的发生，导致大量果实腐烂。赤衣病在南方果区发病较重，也可引起死枝、死树。\n
            常见的果实病害主要有果实轮纹病、霉心病、炭疽病、锈果病及褐腐病等。苹果轮纹病是目前最为严重的果实病害之一，发病严重年份，病果率高达50%以上，采后贮藏期间烂果更为严重。霉心病、炭疽病和锈果病几乎在各大苹果产区均有发生，并造成不同程度危害。\n
            `,
    sicks: [
      {
        name: "苹果褐斑病",
        img: "https://pic.imgdb.cn/item/625e864c239250f7c5ba13b0.png",
        desp: "病斑褐色，边缘绿色不整齐，故有绿缘褐斑病之称。",
      },
      {
        name: "苹果褐腐病",
        img: "https://pic.imgdb.cn/item/625e8669239250f7c5ba4a17.png",
        desp: "被害果实表面初现浅褐色小斑，软腐状。病斑迅速向外扩展，在10 ℃时约经10天即可使整个果实腐烂。病果的果肉松软成海绵状，略有韧性。",
      },
      {
        name: "苹果疫腐病",
        // img: appleYiFu.png,
        desp: "果实受害后果面产生不规则形，深浅不匀的暗红色病斑，边缘不清晰似水渍状。",
      },
      {
        name: "苹果黑星病",
        // img: appleHeiXing.png,
        desp: "是由苹果黑星菌侵染所引起的、发生在苹果上的病害。主要危害叶片或果实，叶柄、果柄、花芽、花器及新梢，从落花期到苹果成熟期均可危害。",
      },

      {
        name: "苹果雪松锈病",
        img: "https://pic.imgdb.cn/item/625e86ab239250f7c5badead.png",
        desp: "雪松-苹果锈病是一种真菌疾病，需要酒糟鼻宿主 (如苹果)和雪松宿主 (如东方红雪松)。 在苹果上，开花后首先可见明亮的橙黄色病变。",
      },
    ],
  },
  {
    name: "蓝莓",
    engName: "blueberry",
    img: blueberry,
    desp: `蓝莓（学名：Vaccinium spp.）是杜鹃花科、越橘属蓝果类型植物的俗称。多年生低灌木。灌木丛生，树体大小及形态差异显著。蓝莓的花为总状花序。花序大部分侧生，有时顶生。通常由7-10朵花组成，花两性。蓝莓果实大小、颜色因种类而异。多数品种成熟时果实呈深蓝色或紫罗兰色，如兔眼蓝莓、高丛蓝莓和矮丛蓝莓等，少数品种为红色。果实有球形、椭圆形、扁圆形或梨形。蓝莓果实一般在花后70-90天成熟。果肉细软，多浆汁。\n
        蓝莓作为一种具有较高经济价值和广阔开发前景的新兴小浆果树种，蓝莓果实肉质细腻，种子极小，甜酸适口，有清爽宜人的香气，富含多种维生素及微量元素等营养物质。
        `,
    disease: `
            蓝莓主要病虫害有“蛀干类天牛”、“金龟子”的幼虫、蛴螬，以及“叶片失绿症”、“叶枯病”、“僵果病”、“食叶类刺蛾”等常见病虫害情况。防治的好则可以避免发生。\n
            蓝莓原产美洲，因其富含富含花青素、紫檀芪及多种微量元素，具极高的营养价值与巨大的市场潜力,近年来蓝莓种植、蓝莓苗木、蓝莓深加工等行业正在中国迅速崛起，尤其在气候土壤环境优越的南方地区，每年都涌现出大量的蓝莓种植户。\n
            然而囿于知识、技术、经验等因素的欠缺，广大蓝莓种植户在存在着许多的不足，导致经济效益受到制约，是当下蓝莓种植户常见的情况。
            `,
    sicks: [
      {
        name: "蓝莓红色轮状斑点病",
        img: "https://pic.imgdb.cn/item/625e86da239250f7c5bb4dcd.png",
        desp: "植株受病时，1年生枝条的叶片往往表现有中间呈绿色的轮状红色斑点，斑点的直径为0.05-0.1cm。到夏秋季节，老叶片的上半部分亦呈现此症状。",
      },
      {
        name: "蓝莓灰霉病",
        img: "https://pic.imgdb.cn/item/625e86ed239250f7c5bb79d5.png",
        desp: "感病嫩梢枯死，长出灰色霉状物；感病叶片叶尖出现“V”字形褐色病斑。嫩梢枯死，附着霉状物。叶尖出现“V”字形褐色病斑。",
      },
      {
        name: "蓝莓炭疽病",
        img: "https://pic.imgdb.cn/item/625e86ed239250f7c5bb79de.png",
        desp: "感病叶片出现棕红色或黑褐色边界明显的病斑，病菌子实体同心轮纹状排列。棕红色同心轮纹状病斑及黑褐色同心轮纹状病斑。",
      },
      {
        name: "蓝莓枝枯病",
        img: "https://pic.imgdb.cn/item/625e86ed239250f7c5bb79ed.png",
        desp: "受害枝条病部的木质部表面变为棕色或黄褐色,组织坏死,可蔓延至整个枝条,感病枝条上的叶片枯死。木质部表面为棕色、组织坏死。感病枝条叶片枯死。",
      },
      {
        name: "蓝莓红色环斑病毒病",
        img: "https://pic.imgdb.cn/item/625e86cc239250f7c5bb2d9f.png",
        desp: "感病枝条上部叶片发红，表面具有红色斑点，严重者叶片干枯，新生枝条上端叶片发生严重。上部叶片产生红色斑点。",
      },
    ],
  },

  {
    name: "樱桃",
    engName: "cherry",
    img: cherry,
    desp: `樱桃（学名：Cerasus spp.）是蔷薇科、樱属几种植物的统称。世界上作为栽培的樱桃仅有4种，即樱桃（Cerasus pseudocerasus (Lindl.) G. Don）、欧洲甜樱桃（Cerasus avium (L.) Moench.）、欧洲酸樱桃（Cerasus vulgaris Mill.）和毛樱桃（Cerasus tomentosa (Thunb.) Wall.）。 [1]  其中在生产上起重要作用的是樱桃、欧洲甜樱桃和欧洲酸樱桃。 [2]  乔木或灌木，高2-25米，树皮灰白色或黑褐色。小枝灰褐色或灰棕色，嫩枝绿色，无毛或被疏柔毛。冬芽卵状椭圆形，无毛。叶片卵形、椭圆形或长圆状卵形，先端骤尖或短渐尖，基部圆形或楔形。花序伞形，有花3-4朵，花叶同开；花梗长0.8-3.4厘米，被疏柔毛或无毛；萼片三角卵圆形或卵状长圆形，先端圆钝或急尖；花瓣白色或粉红色，倒卵形。核果近球形或卵球形，呈红色至紫黑色，直径0.9-2.5厘米。花期3-5月，果期5-9月.\n
        主要分布于欧洲、亚洲及北美等地。生于山坡林中、林缘、灌丛中或草地。适宜的土壤pH值为6.5-7.5的中性环境，在土层深厚、土质疏松、通气良好的砂壤土上生长较好。樱桃在中国久经栽培，品种颇多，供食用，也可酿樱桃酒。枝、叶、根、花也可供药用。 [3]  除了鲜食外，还可以加工制作成樱桃酱、樱桃汁、樱桃罐头和果脯、露酒等，具有艳红色泽，杏仁般的香气，食之使人迷醉。
        `,
    disease: `
            危害樱桃树的主要病虫害有桑白蚧、刺蛾、桃红颈天牛、苹果透翅蛾、金缘吉丁虫、金龟子、梨小食心虫和炭疽病、樱桃叶斑病、细菌性穿孔病、流胶病、根颈腐烂病等，应采取综合措施加以防治。以及，流胶病：致病菌为真菌,与杨树溃疡病、苹果枝干轮纹病菌同类。该病菌的侵入与土壤、栽培、树势、根呼吸等生理因素有关；树体因缺钙、硼或坏死环斑病毒造成皮下溃疡，可致病菌侵染，引发流胶。木腐病：致病菌为担子真菌,与蘑菇属同类菌，该病菌病菌2-3年才能生出繁殖体，繁殖较慢。病菌从大的剪锯口侵入，破坏木质部纤维组织，造成营养输导困难，外面完好，内部腐烂，感病树枝易折。\n
            在冬季修剪时，剪除并烧毁病虫枝，同时在落叶期喷布波美5度石硫合剂一次；在春梢叶片停长前，喷40%乐果1200倍液加70%甲基托布津800倍液一次；7-8月喷50%马拉松乳剂1000倍液加65%代森锌400-500倍液一次。\n
            加强栽培管理，增强树势，提高树体的抗病能力。结合剪枝，彻底剪除病枯枝，清除落叶、落果，以消灭越冬病原。喷布5波美度石硫合剂，3月上旬芽体萌动时均匀细致地喷布5波美度石硫合剂。用药要求树上及地下均匀覆盖，这样可大大减轻当年病虫危害的程度。修剪后及时涂抹油漆、乳胶漆保护伤口，其中混加戊唑醇等三唑类药剂效果更好，浓度为生长季节喷雾浓度的5～10倍。
            `,
    sicks: [
      {
        name: "樱桃流胶病",
        img: "https://pic.imgdb.cn/item/625e8714239250f7c5bbddd3.png",
        desp: "致病菌为真菌,与杨树溃疡病、苹果枝干轮纹病菌同类。",
      },
      {
        name: "樱桃木腐病",
        img: "https://pic.imgdb.cn/item/625e8714239250f7c5bbde47.png",
        desp: "致病菌为担子真菌,与蘑菇属同类菌，该病菌病菌2-3年才能生出繁殖体，繁殖较慢。病菌从大的剪锯口侵入，破坏木质部纤维组织",
      },
      {
        name: "樱桃褐斑病",
        // img: cherryHeBan.png,
        desp: "褐斑病6月下旬或7月初始见发生,7月下旬进入发病高峰;",
      },
      {
        name: "樱桃白粉病",
        img: "https://pic.imgdb.cn/item/625e8714239250f7c5bbddc4.png",
        desp: "白粉病为樱桃番茄的普通病害，在局部地区发生分布，多在保护地内发病。 通常病情较轻",
      },
    ],
  },

  {
    name: "葡萄",
    engName: "grape",
    img: grape,
    desp: `葡萄（学名：Vitis vinifera L.）为葡萄科葡萄属木质藤本植物，小枝圆柱形，有纵棱纹，无毛或被稀疏柔毛，叶卵圆形，圆锥花序密集或疏散，基部分枝发达，果实球形或椭圆形，花期4-5月，果期8-9月。\n
        葡萄是世界最古老的果树树种之一，葡萄的植物化石发现于第三纪地层中，说明当时已遍布于欧、亚及格陵兰。 葡萄原产亚洲西部，世界各地均有栽培，世界各地的葡萄约95%集中分布在北半球。\n
        葡萄为著名水果，生食或制葡萄干，并酿酒，酿酒后的酒脚可提酒石酸，根和藤药用能止呕、安胎。\n
        `,
    disease: `
            葡萄病害种类较多，其中，危害比较严重的有10余种，如霜霉病、白腐病、黑痘病、炭疽病、褐斑病、白粉病、蔓枯病、根癌病、穗轴褐枯病、灰霉病、扇叶病毒病、房枯病、黑腐病等。葡萄生长发育的各个阶段均可遭受多种害虫的危害，致使品质和产量下降。为害葡萄的害虫有300多种，一般发生普遍而严重的有10多种。侵害芽、叶的刺吸口器害虫主要有葡萄斑叶蝉、绿盲蝽、烟蓟马等，都造成葡萄嫩梢萎蔫、叶片枯焦早落。咀嚼式口器食叶害虫中最常见的有葡萄天蛾、金龟甲类；葡萄透翅蛾和葡萄虎天牛则是重要的蛀干害虫；葡萄粉蚧类介壳虫主要聚集在枝蔓上刺吸汁液，并常诱发霉菌和其他传染性病害的发生。\n
            葡萄病虫害防治首先是保持树体健壮，提高抗病能力，严格枝蔓和花果的管理。使架面通风透光良好，控制结果量，施足基肥，增施磷、钾肥，后期喷施叶面肥。结合冬剪，剪除有病枝蔓，刮剥老蔓枯皮，清除枯枝落叶集中烧毁。发病季节要及时剪除病果、病枝、病叶，并带离果园。冬芽萌动前全园喷5度石硫合剂，进一步杀死病菌和虫卵。\n
            使用农药治理的思路：1.加强预测预报，治早治小。2.轮换交替施用生物农药，避免病虫产生抗性。3.对症下药，以主治主要病虫害，兼治次要病虫害为依据选择药剂。4.提高配药质量，粉剂、乳剂、胶悬剂要先用少量水配成母液，搅拌均匀，然后再加水稀释成所需的倍数，边加水边搅拌。5.合理混合施用，及时防治多种病虫，节约劳力。6.适量用药，不随意加大和降低浓度。
            `,
    sicks: [
      {
        name: "葡萄炭疽病",
        img: "https://pic.imgdb.cn/item/625e8744239250f7c5bc473a.png",
        desp: "是对葡萄生产威胁较大的病害，能造成果实大量腐烂，还能侵害苹果、梨等多种果树。主要危害着色或接近成熟的果实。",
      },
      {
        name: "葡萄黑痘病",
        img: "https://pic.imgdb.cn/item/625e8744239250f7c5bc4718.png",
        desp: "主要危害葡萄的绿色幼嫩部分，如果实、果梗、叶片、叶柄、新梢和卷须等。发病规律：葡萄黑痘病是由真菌引起的病害。",
      },
      {
        name: "葡萄白腐病",
        img: "https://pic.imgdb.cn/item/625e8744239250f7c5bc4703.png",
        desp: "主要危害葡萄的果穗，也危害新梢和叶片。",
      },
      {
        name: "葡萄褐斑病",
        img: "https://pic.imgdb.cn/item/625e8744239250f7c5bc470d.png",
        desp: "分大褐斑病和小褐病两种,造成早期落叶，影响产量，削弱树势。",
      },
      {
        name: "葡萄黑腐病",
        img: "https://pic.imgdb.cn/item/625e8744239250f7c5bc4728.png",
        desp: "主要危害葡萄果实，也可侵害叶片、叶柄和新梢。",
      },
    ],
  },

  {
    name: "辣椒",
    engName: "pepper",
    img: pepper,
    desp: `辣椒，别名：牛角椒、长辣椒、菜椒、灯笼椒，拉丁文名：Capsicum annuum L.，为木兰纲、茄科、辣椒属一年或有限多年生草本植物。茎近无毛或微生柔毛，分枝稍之字形折曲。叶互生，枝顶端节不伸长而成双生或簇生状，矩圆状卵形、卵形或卵状披针形，全缘，顶端短渐尖或急尖，基部狭楔形；花单生，俯垂；花萼杯状，不显著5齿；花冠白色，裂片卵形；花药灰紫色。果梗较粗壮，俯垂；果实长指状，顶端渐尖且常弯曲，未成熟时绿色，成熟后成红色、橙色或紫红色，味辣。种子扁肾形，淡黄色\n
        辣椒生育初为发芽期，催芽播种后一般5-8天左右出土，15天左右出现第一片真叶，到花蕾显露为幼苗期。第一花穗到门椒坐主为开花期。坐果后到拔秧为结果期。辣椒适宜的温度在15-34度之间。种子发芽适宜温度25-30度，发芽需要5-7天，低于15度或高于35度时种子不发芽。\n
        辣椒对条件水分要求严格，它既不耐旱也不耐涝。喜欢比较干爽的空气条件。\n
        `,
    disease: `
            辣椒病毒病一般由几种病毒复合侵染，通常表现花叶、黄化、畸形等症状。病毒病在高温干旱年份发病重，主要通过种子、移栽伤口和蚜虫侵染。目前我国已检测到的辣椒病毒病有10多种，其中烟草花叶病毒（Tobacco mosaic virus，TMV）和黄瓜花叶病毒（Cucumber mosaic virus，CMV）较为常见。针对辣椒病毒病的传播途径以及发生规律，其防治方法主要分为物理防治、化学防治、生物防治、农艺防治4种。物理防治通过杀虫灯、黄板或蓝板、性诱剂等趋避蚜虫与白粉虱等媒介昆虫，从源头阻碍病毒的传播。\n
            化学防治主要通过化学农药对病毒进行预防和控制，播种前用10%三磷酸钠液浸泡25 min，清洗3遍后晾干以避免种子带毒；从苗期开始，可用10%吡虫啉可湿性粉剂1 000倍液喷雾，防治蚜虫与粉虱等媒介昆虫；发现病株后，需立即拔除以防止病毒扩散，初发病期可用20%病毒灵可湿性粉剂600倍液，或选用2%菌克水剂300倍液加有机络合肥喷施，每隔7~10 d喷1次，连喷3~4次。\n
            在农艺防治上，一是因地制宜选择抗病性较强的品种，如茂椒6号、红丰404等；二是播种前对种子进行消毒处理，以预防种传病毒，同时覆盖银灰色地膜以趋避蚜虫；三是合理密植、合理施肥和灌溉、与非茄科作物轮作等。这些措施都能大大减轻病害发生。\n
            `,
    sicks: [
      {
        name: "辣椒灰霉病",
        img: `https://pic.imgdb.cn/item/625e879a239250f7c5bd1b94.png`,
        desp: "幼苗发病，幼茎缢缩变细，子叶腐烂，幼苗倒折死亡。成株发病，多茎部产生不规则形水浸状病斑，后变褐色至灰白色，病斑扩展到绕茎一周时，其上端枝叶萎蔫枯死。",
      },
      {
        name: "辣椒白粉病",
        img: `https://pic.imgdb.cn/item/625e879a239250f7c5bd1b85.png`,
        desp: "此病仅危害叶片，老叶嫩叶均可染病，病叶正面初生褪绿小黄点，以后扩展为边缘不明显的褪绿黄色病斑",
      },
      {
        name: "辣椒炭疽病",
        img: `https://pic.imgdb.cn/item/625e879a239250f7c5bd1b9e.png`,
        desp: "辣椒炭疽病主要为害果实和叶片，也可侵染茎部。叶片染病，初呈水浸状褪色绿斑，后逐渐变为褐色。",
      },
      {
        name: "辣椒叶枯病",
        img: `https://pic.imgdb.cn/item/625e87e7239250f7c5bdd0f2.png`,
        desp: "辣椒叶枯病主要危害叶片，有时危害叶柄及茎。叶片发病开始为褐色小点，迅速扩大后为圆形或不规则形病斑",
      },
      {
        name: "辣椒白星病",
        img: `https://pic.imgdb.cn/item/625e879a239250f7c5bd1b8a.png`,
        desp: "辣椒白星病又称斑点病。危害叶片。",
      },

      {
        name: "辣椒细菌性叶斑病",
        img: `https://pic.imgdb.cn/item/625e879a239250f7c5bd1ba8.png`,
        desp: "叶片先出现点状病，水浸状，不规则形，褪绿，后发展为褐色至铁锈色，病部薄膜状。干燥时病斑呈铁锈色，病斑质脆，有的穿孔。",
      },
    ],
  },

  {
    name: "土豆",
    engName: "potato",
    img: potato,
    desp: `马铃薯原产安第斯山区和智利沿海山地，当地印第安人将其作为主要食物，后由欧洲探险家和殖民者将其传至全球。1536年由西班牙水手引种到欧洲，1565年马铃薯引到英国爱尔兰，1785年被药剂师法尔孟契引入法国。它很长阶段都作为奇花异草观赏，甚至因为法国王后将其花朵戴在头上做装饰而使得当时的法国将其作为时髦高贵的象征。当代英国农学家霍克斯（P.M. Hawkes）在其《马铃薯的改良科学基础·历史》中说，马铃薯约十七世纪传入印度，引至中国还稍早些。日本的土豆是荷兰人于1598年带至长崎港。\n
        初生叶为单叶，全缘。随植株的生长，逐渐形成羽状复叶。 多年生草本，但作一年生或一年两季栽培。地下块茎呈圆、卵、椭圆等形，有芽眼，皮红、黄、白或紫色。地上茎呈棱形，有毛。奇数羽状复叶。聚伞花序顶生，花白、红或紫色。浆果球形，绿或紫褐色。种子肾形，黄色。\n
        `,
    disease: `
            土豆的病害分为以下几种：\n
          生理性病害:生理性病害是由于环境条件不适应马铃薯的生长发育而产生的危害。主要有缺素症、不良气候危害、药害等。细菌性病害:细菌性病害主要包括青枯病、环腐病、黑胫病、软腐病四种。带病种薯、未腐熟的病株残体等都可成为侵染源。带病种薯、切刀、中耕机具、运输工具、贮藏场所部可起传染作用。甚至浸种催芽也能扩大传染。因此，防治上采用防治结合就非常必要。\n
          病毒病:已发现能侵染马铃薯的病毒有18种，病毒病在田间靠昆虫(主要是蚜虫)或叶片接触而传播，表现花叶、叶片卷曲或皱缩等茎叶异常现象，并造成巨大损失。由于日前仍无有效药品治愈本病，因此，防治上主要利用艾美乐、康福多等化学药剂杀灭传毒昆虫，或用种子处理剂―――高巧或锐劲特作包衣处理，从而减少病毒病的传播。虫害：蚜虫,蝼蛄,地老虎,块茎蛾.
            `,
    sicks: [
      {
        name: "土豆晚疫病",
        img: `https://pic.imgdb.cn/item/625e8845239250f7c5bec88b.png`,
        desp: "晚疫病是马铃薯主产区最重要的一种真菌病害，其最初传播来源是邻近的薯田或番茄、杂草和有机堆肥。",
      },
      {
        name: "土豆癌肿病",
        img: `https://pic.imgdb.cn/item/625e8845239250f7c5bec87e.png`,
        desp: "主要在地下部分，侵染茎基部、匍匐茎和块茎，病菌侵入寄主刺激细胞组织增生",
      },
      {
        name: "土豆早疫病",
        img: `https://pic.imgdb.cn/item/625e880e239250f7c5be3574.png`,
        desp: "主要发生在叶片上，也可侵染块茎。叶片染病，病斑黑褐色，渐扩展成圆形或近圆形的黑褐色病斑",
      },
      {
        name: "马铃薯青枯病",
        img: `https://pic.imgdb.cn/item/625e8845239250f7c5bec885.png`,
        desp: "一种维管束病害，在马铃薯整个生长期都可发生",
      },
    ],
  },

  {
    name: "番茄",
    engName: "tomato",
    img: tomato,
    desp: `番茄起源中心是南美洲的安第斯山地带。在秘鲁、厄瓜多尔、玻利维亚等地，至今仍有大面积野生种的分布。番茄属分为有色番茄亚种和绿色番茄亚种。前者果实成熟时有多种颜色，后者果实成熟时为绿色。番茄属由普通栽培种番茄及与栽培种番茄有密切关系的几个种组成，大体上又分为普通番茄和秘鲁番茄两个复合体种群。普通番茄群中包括：普通番茄、细叶番茄、奇士曼尼番茄、小花番茄和奇美留斯凯番茄、多毛番茄；秘鲁番茄群中包括智利番茄和秘鲁番茄。\n
        番茄是茄科一年生草本植物，株高0.6～2米，全体生粘质腺毛，有强烈气味。茎易倒伏。叶羽状复叶或羽状深裂，长10～40厘米，小叶极不规则，大小不等，常5～9枚，卵形或矩圆形，长5～7厘米，边缘有不规则锯齿或裂片。花序总梗长2～5厘米，常3～7朵花；花梗长1～1.5厘米；花萼辐状，裂片披针形，果时宿存；花冠辐状，直径约2厘米，黄色。浆果扁球状或近球状，肉质而多汁液，桔黄色或鲜红色，光滑；种子黄色。花果期夏秋季。
        `,
    disease: `
          番茄的主要病害有以下几种\n
          青枯病，顶端叶片先萎蔫下垂，然后下部凋萎。发病初期病株白天萎蔫，傍晚复原，病叶变浅，几日后整株枯死。茎中下部增生不定根，湿度大时横切病茎，用手挤压，切面上维管束溢出白色菌液。防治方法。青枯病应以预防为主，以海洋芽孢杆菌、多粘类芽孢杆菌整个作物生育期灌根或浇泼多次，防治病害的同时还能起到壮苗的作用。发病后及时拔除病株，相邻植株均撒上石灰防止病情蔓延。防止水流传带病菌。\n
          番茄早疫病，番茄早疫病又称为轮纹病、夏疫病，是番茄的一种主要叶部病害，各地均有发作。普通一年内茎叶发病率在10%左右，盛行年或重病田可达100%。防治办法。早疫病菌在分类上比晚疫病高级也比拟顽固，运用对混合感染病害效果突出的丁子香芹酚（绿色种植规范允许运用）防治。在发病初期，运用丁子香芹酚500倍液喷施番茄茎、叶部，隔5-7天施用一次。关于感病严重的果实和植株，及时带出集中堆肥。前期预防可选用百菌清/嘧菌酯等药剂，发作后还要加上用苯醚甲环唑等三唑类内吸治疗性药剂即可停止防治。\n
          其他的病症还有：灰霉病，斑枯病等等。
            `,
    sicks: [
      {
        name: "番茄早疫病",
        img: `https://pic.imgdb.cn/item/625e88c1239250f7c5c02b3a.png`,
        desp: "病菌从叶片、花、果实等气孔、皮孔或表皮等直接侵入，3-4天后出现病斑，再经3-4天出现孢子，通过气流和雨水飞溅传播，多次再侵染，导致病害不断蔓延。",
      },
      {
        name: "番茄晚疫病",
        img: `https://pic.imgdb.cn/item/625e8892239250f7c5bfa8ba.png`,
        desp: "病菌借气流或雨水从番茄的气孔、伤口或表皮直接侵入，也可以从茎的伤口、皮孔侵入。主要原因还是有伤口导致细菌侵入发生的。",
      },
      {
        name: "番茄细菌性髓部坏死",
        img: `https://pic.imgdb.cn/item/625e88c1239250f7c5c02b3e.png`,
        desp: "失水萎蔫、褪绿，剖开茎基部，里面变色，而且变色长度超过外表皮。3、里面干缩中空，逐渐延伸",
      },
      {
        name: "番茄溃疡病",
        img: `https://pic.imgdb.cn/item/625e8892239250f7c5bfa8a2.png`,
        desp: "茎略变粗，生出许多疣刺或不定根。湿度大时有污白色菌脓溢出，果实有有疣状凸起，类似鸟眼。",
      },
      {
        name: "番茄灰霉病",
        img: `https://pic.imgdb.cn/item/625e8892239250f7c5bfa896.png`,
        desp: "番茄灰霉病主要危害果实，也能够损害叶片和茎等部位。",
      },
      {
        name: "番茄斑枯病",
        img: `https://pic.imgdb.cn/item/625e8892239250f7c5bfa8d8.png`,
        desp: "斑枯病多从植株下部叶片开端，叶正背面均呈现圆形或近圆形病斑",
      },

      {
        name: "番茄青枯病",
        img: `https://pic.imgdb.cn/item/625e8892239250f7c5bfa8ae.png`,
        desp: "青枯病，顶端叶片先萎蔫下垂，然后下部凋萎。",
      },
    ],
  },

  {
    name: "草莓",
    engName: "strawberry",
    img: strawberry,
    desp: `草莓（英文学名：strawberry、拉丁学名：Fragaria × ananassa Duch.），多年生草本植物。高10-40厘米，茎低于叶或近相等，密被开展黄色柔毛。叶三出，小叶具短柄，质地较厚，倒卵形或菱形，上面深绿色，几无毛，下面淡白绿色，疏生毛，沿脉较密；叶柄密被开展黄色柔毛。聚伞花序，花序下面具一短柄的小叶；花两性；萼片卵形，比副萼片稍长；花瓣白色，近圆形或倒卵椭圆形。聚合果大，宿存萼片直立，紧贴于果实；瘦果尖卵形，光滑。花期4-5月，果期6-7月\n
        原产南美，中国各地及欧洲等地广为栽培。草莓中国国内优良品种草莓栽培的品种很多，全世界共有20000多个，但大面积栽培的优良品种只有几十个。中国自己培育的和从国外引进的新品种有200-300个。\n
        `,
    disease: `
            草莓主要的病害分为以下几种：\n
          白粉病：草莓白粉病 (Strawberry powdery mildew )属于子囊菌亚门核菌纲白粉菌目白粉菌科是草莓生产中的主要病害，发生严重时会严重影响了草莓的产量、品质和经济效益。在草莓整个生长季节均可发生，苗期染病造成秧苗素质下降，移植后不易成活。\n
          炭疽病:草莓炭疽病（Strawberry Anthracnose）属于半知菌亚门毛盘孢属草莓炭疽菌侵染所致，是草莓生产中常见的病害，主要发生在育苗期和定值初期，结果期很少发生。主要为害匍匐茎、叶柄、叶片、果实。叶片受害时初产生黑色纺锤形稍凹陷溃疡斑；匍匐茎和叶柄行成环形圈病斑，扩展后病斑以上部分萎蔫枯死；\n
          灰霉病: 草莓灰霉病（ Strawberry Gray Mould）病原为半知菌亚门葡萄孢属的灰霉菌,该菌腐生性强,寄主范围广,孢子细长。主要为害花器、果实、也为害果柄、叶片。花器发病花萼上有针眼大水渍状的小斑点，后扩展成较大病斑，使幼果湿软腐烂.\n
          常见的其他病害有：细菌性叶斑病，红中柱根腐病，蛇眼病等等
          `,
    sicks: [
      {
        name: "草莓白粉病",
        img: `https://pic.imgdb.cn/item/625e886e239250f7c5bf3e54.png`,
        desp: "草莓主要病害之一，在保护地栽培中发生最严重，整个生长期内均可发生。",
      },
      {
        name: "草莓灰霉病",
        img: `https://pic.imgdb.cn/item/625e886e239250f7c5bf3e62.png`,
        desp: "是开花后的主要病害。尤其在浆果成熟期表现最显著。",
      },
      {
        name: "草莓炭疽病",
        img: `https://pic.imgdb.cn/item/625e886e239250f7c5bf3e6e.png`,
        desp: "主要发生在育苗期和定植初期，结果期很少发生。",
      },
    ],
  },
];
